Adding requested information to readme, change db diagrams to mermaid diagrams
